@toddgiguere  For the dedicated host I have updated the code as per the requirements. The key reference is based on Host-Group+Host-Name. Hence on revised deployments terraform will refer the same to avoid conflicts and removal of existing resources. Attaching the Plan output since Im unable to test it in the environment.
erraform will perform the following actions:

  ```
# module.dedicated_host.ibm_is_dedicated_host.dh_host["jh-test-dhgroup-1-jh-test-dhhost-1"] will be created
  + resource "ibm_is_dedicated_host" "dh_host" {
      + access_tags                 = (known after apply)
      + available_memory            = (known after apply)
      + available_vcpu              = (known after apply)
      + created_at                  = (known after apply)
      + crn                         = (known after apply)
      + disks                       = (known after apply)
      + host_group                  = (known after apply)
      + href                        = (known after apply)
      + id                          = (known after apply)
      + instance_placement_enabled  = true
      + instances                   = (known after apply)
      + lifecycle_state             = (known after apply)
      + memory                      = (known after apply)
      + name                        = "jh-test-dhhost-1"
      + numa                        = (known after apply)
      + profile                     = "bx2-host-152x608"
      + provisionable               = (known after apply)
      + resource_group              = (known after apply)
      + resource_type               = (known after apply)
      + socket_count                = (known after apply)
      + state                       = (known after apply)
      + supported_instance_profiles = (known after apply)
      + vcpu                        = (known after apply)
      + zone                        = (known after apply)
    }

  # module.dedicated_host.ibm_is_dedicated_host.dh_host["jh-test-dhgroup-1-jh-test-dhhost-2"] will be created
  + resource "ibm_is_dedicated_host" "dh_host" {
      + access_tags                 = (known after apply)
      + available_memory            = (known after apply)
      + available_vcpu              = (known after apply)
      + created_at                  = (known after apply)
      + crn                         = (known after apply)
      + disks                       = (known after apply)
      + host_group                  = (known after apply)
      + href                        = (known after apply)
      + id                          = (known after apply)
      + instance_placement_enabled  = true
      + instances                   = (known after apply)
      + lifecycle_state             = (known after apply)
      + memory                      = (known after apply)
      + name                        = "jh-test-dhhost-2"
      + numa                        = (known after apply)
      + profile                     = "bx2-host-152x608"
      + provisionable               = (known after apply)
      + resource_group              = (known after apply)
      + resource_type               = (known after apply)
      + socket_count                = (known after apply)
      + state                       = (known after apply)
      + supported_instance_profiles = (known after apply)
      + vcpu                        = (known after apply)
      + zone                        = (known after apply)
    }

  # module.dedicated_host.ibm_is_dedicated_host_group.dh_group["jh-test-dhgroup-1"] will be created
  + resource "ibm_is_dedicated_host_group" "dh_group" {
      + class                       = "bx2"
      + created_at                  = (known after apply)
      + crn                         = (known after apply)
      + dedicated_hosts             = (known after apply)
      + family                      = "balanced"
      + href                        = (known after apply)
      + id                          = (known after apply)
      + name                        = "jh-test-dhgroup-1"
      + resource_group              = (known after apply)
      + resource_type               = (known after apply)
      + supported_instance_profiles = (known after apply)
      + zone                        = "us-south-1"
    }

  # module.resource_group.ibm_resource_group.resource_group[0] will be created
  + resource "ibm_resource_group" "resource_group" {
      + created_at          = (known after apply)
      + crn                 = (known after apply)
      + default             = (known after apply)
      + id                  = (known after apply)
      + name                = "jh-test-resource-group"
      + payment_methods_url = (known after apply)
      + quota_id            = (known after apply)
      + quota_url           = (known after apply)
      + resource_linkages   = (known after apply)
      + state               = (known after apply)
      + teams_url           = (known after apply)
      + updated_at          = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dedicated_host_group_id = {
      + jh-test-dhgroup-1-jh-test-dhhost-1 = [
          + (known after apply),
        ]
      + jh-test-dhgroup-1-jh-test-dhhost-2 = [
          + (known after apply),
        ]
    }
  + dedicated_host_id       = [
      + (known after apply),
      + (known after apply),
    ]
  + resource_group_id       = (known after apply)
  + resource_group_name     = "jh-test-resource-group"
```

cc: @nupurg-ibm @bksagar 